zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/same54/atsame54n20a-pinctrl.h
/* pa9f_tcc0_wo1 */
#define PA9F_TCC0_WO1 MCHP_PINMUX(a, 9, f, periph)

/* pa9g_tcc1_wo5 */
#define PA9G_TCC1_WO5 MCHP_PINMUX(a, 9, g, periph)

/* pa9h_qspi_data1 */
#define PA9H_QSPI_DATA1 MCHP_PINMUX(a, 9, h, periph)

/* pa9i_sdhc0_sddat0 */
#define PA9I_SDHC0_SDDAT0 MCHP_PINMUX(a, 9, i, periph)

/* pa9j_i2s_fs0 */
#define PA9J_I2S_FS0 MCHP_PINMUX(a, 9, j, periph)

/* pa9n_ccl_in4 */
#define PA9N_CCL_IN4 MCHP_PINMUX(a, 9, n, periph)

/* pa10_gpio */
#define PA10_GPIO MCHP_PINMUX(a, 10, gpio, gpio)

/* pa10a_eic_extint10 */
#define PA10A_EIC_EXTINT10 MCHP_PINMUX(a, 10, a, periph)

/* pa10b_adc0_ain10 */
#define PA10B_ADC0_AIN10 MCHP_PINMUX(a, 10, b, periph)

/* pa10b_adc0_x8 */
#define PA10B_ADC0_X8 MCHP_PINMUX(a, 10, b, periph)

/* pa10b_adc0_y8 */
#define PA10B_ADC0_Y8 MCHP_PINMUX(a, 10, b, periph)

/* pa10c_sercom0_pad2 */
#define PA10C_SERCOM0_PAD2 MCHP_PINMUX(a, 10, c, periph)

/* pa10d_sercom2_pad2 */
#define PA10D_SERCOM2_PAD2 MCHP_PINMUX(a, 10, d, periph)

/* pa10e_tc1_wo0 */
#define PA10E_TC1_WO0 MCHP_PINMUX(a, 10, e, periph)

/* pa10f_tcc0_wo2 */
#define PA10F_TCC0_WO2 MCHP_PINMUX(a, 10, f, periph)

/* pa10g_tcc1_wo6 */
#define PA10G_TCC1_WO6 MCHP_PINMUX(a, 10, g, periph)

/* pa10h_qspi_data2 */
#define PA10H_QSPI_DATA2 MCHP_PINMUX(a, 10, h, periph)

/* pa10i_sdhc0_sddat1 */
#define PA10I_SDHC0_SDDAT1 MCHP_PINMUX(a, 10, i, periph)

/* pa10j_i2s_sck0 */
#define PA10J_I2S_SCK0 MCHP_PINMUX(a, 10, j, periph)

/* pa10m_gclk_io4 */
#define PA10M_GCLK_IO4 MCHP_PINMUX(a, 10, m, periph)

/* pa10n_ccl_in5 */
#define PA10N_CCL_IN5 MCHP_PINMUX(a, 10, n, periph)

/* pa11_gpio */
#define PA11_GPIO MCHP_PINMUX(a, 11, gpio, gpio)

/* pa11a_eic_extint11 */
#define PA11A_EIC_EXTINT11 MCHP_PINMUX(a, 11, a, periph)

/* pa11b_adc0_ain11 */
#define PA11B_ADC0_AIN11 MCHP_PINMUX(a, 11, b, periph)

/* pa11b_adc0_x9 */
#define PA11B_ADC0_X9 MCHP_PINMUX(a, 11, b, periph)

/* pa11b_adc0_y9 */
#define PA11B_ADC0_Y9 MCHP_PINMUX(a, 11, b, periph)

/* pa11c_sercom0_pad3 */
#define PA11C_SERCOM0_PAD3 MCHP_PINMUX(a, 11, c, periph)

/* pa11d_sercom2_pad3 */
#define PA11D_SERCOM2_PAD3 MCHP_PINMUX(a, 11, d, periph)

/* pa11e_tc1_wo1 */
#define PA11E_TC1_WO1 MCHP_PINMUX(a, 11, e, periph)

/* pa11f_tcc0_wo3 */
#define PA11F_TCC0_WO3 MCHP_PINMUX(a, 11, f, periph)

/* pa11g_tcc1_wo7 */
#define PA11G_TCC1_WO7 MCHP_PINMUX(a, 11, g, periph)

/* pa11h_qspi_data3 */
#define PA11H_QSPI_DATA3 MCHP_PINMUX(a, 11, h, periph)

/* pa11i_sdhc0_sddat2 */
#define PA11I_SDHC0_SDDAT2 MCHP_PINMUX(a, 11, i, periph)

/* pa11j_i2s_sdo */
#define PA11J_I2S_SDO MCHP_PINMUX(a, 11, j, periph)

/* pa11m_gclk_io5 */
#define PA11M_GCLK_IO5 MCHP_PINMUX(a, 11, m, periph)

/* pa11n_ccl_out1 */
#define PA11N_CCL_OUT1 MCHP_PINMUX(a, 11, n, periph)

/* pa12_gpio */
#define PA12_GPIO MCHP_PINMUX(a, 12, gpio, gpio)

/* pa12a_eic_extint12 */
#define PA12A_EIC_EXTINT12 MCHP_PINMUX(a, 12, a, periph)

/* pa12c_sercom2_pad0 */
#define PA12C_SERCOM2_PAD0 MCHP_PINMUX(a, 12, c, periph)

/* pa12d_sercom4_pad1 */
#define PA12D_SERCOM4_PAD1 MCHP_PINMUX(a, 12, d, periph)

/* pa12e_tc2_wo0 */
#define PA12E_TC2_WO0 MCHP_PINMUX(a, 12, e, periph)

/* pa12f_tcc0_wo6 */
#define PA12F_TCC0_WO6 MCHP_PINMUX(a, 12, f, periph)

/* pa12g_tcc1_wo2 */
#define PA12G_TCC1_WO2 MCHP_PINMUX(a, 12, g, periph)

/* pa12i_sdhc0_sdcd */
#define PA12I_SDHC0_SDCD MCHP_PINMUX(a, 12, i, periph)

/* pa12k_pcc_den1 */
#define PA12K_PCC_DEN1 MCHP_PINMUX(a, 12, k, periph)

/* pa12l_gmac_grx1 */
#define PA12L_GMAC_GRX1 MCHP_PINMUX(a, 12, l, periph)

/* pa12m_ac_cmp0 */
#define PA12M_AC_CMP0 MCHP_PINMUX(a, 12, m, periph)

/* pa13_gpio */
#define PA13_GPIO MCHP_PINMUX(a, 13, gpio, gpio)

/* pa13a_eic_extint13 */
#define PA13A_EIC_EXTINT13 MCHP_PINMUX(a, 13, a, periph)

/* pa13c_sercom2_pad1 */
#define PA13C_SERCOM2_PAD1 MCHP_PINMUX(a, 13, c, periph)

/* pa13d_sercom4_pad0 */
#define PA13D_SERCOM4_PAD0 MCHP_PINMUX(a, 13, d, periph)

/* pa13e_tc2_wo1 */
#define PA13E_TC2_WO1 MCHP_PINMUX(a, 13, e, periph)

/* pa13f_tcc0_wo7 */
#define PA13F_TCC0_WO7 MCHP_PINMUX(a, 13, f, periph)

/* pa13g_tcc1_wo3 */
#define PA13G_TCC1_WO3 MCHP_PINMUX(a, 13, g, periph)

/* pa13i_sdhc0_sdwp */
#define PA13I_SDHC0_SDWP MCHP_PINMUX(a, 13, i, periph)

/* pa13k_pcc_den2 */
#define PA13K_PCC_DEN2 MCHP_PINMUX(a, 13, k, periph)

/* pa13l_gmac_grx0 */
#define PA13L_GMAC_GRX0 MCHP_PINMUX(a, 13, l, periph)

/* pa13m_ac_cmp1 */
#define PA13M_AC_CMP1 MCHP_PINMUX(a, 13, m, periph)

/* pa14_gpio */
#define PA14_GPIO MCHP_PINMUX(a, 14, gpio, gpio)

/* pa14a_eic_extint14 */
#define PA14A_EIC_EXTINT14 MCHP_PINMUX(a, 14, a, periph)

/* pa14c_sercom2_pad2 */
#define PA14C_SERCOM2_PAD2 MCHP_PINMUX(a, 14, c, periph)

/* pa14d_sercom4_pad2 */
#define PA14D_SERCOM4_PAD2 MCHP_PINMUX(a, 14, d, periph)

/* pa14e_tc3_wo0 */
#define PA14E_TC3_WO0 MCHP_PINMUX(a, 14, e, periph)

/* pa14f_tcc2_wo0 */
#define PA14F_TCC2_WO0 MCHP_PINMUX(a, 14, f, periph)

/* pa14g_tcc1_wo2 */
#define PA14G_TCC1_WO2 MCHP_PINMUX(a, 14, g, periph)

/* pa14k_pcc_clk */
#define PA14K_PCC_CLK MCHP_PINMUX(a, 14, k, periph)

/* pa14l_gmac_gtxck */
#define PA14L_GMAC_GTXCK MCHP_PINMUX(a, 14, l, periph)

/* pa14m_gclk_io0 */
#define PA14M_GCLK_IO0 MCHP_PINMUX(a, 14, m, periph)

/* pa15_gpio */
#define PA15_GPIO MCHP_PINMUX(a, 15, gpio, gpio)

/* pa15a_eic_extint15 */
#define PA15A_EIC_EXTINT15 MCHP_PINMUX(a, 15, a, periph)

/* pa15c_sercom2_pad3 */
#define PA15C_SERCOM2_PAD3 MCHP_PINMUX(a, 15, c, periph)

/* pa15d_sercom4_pad3 */
#define PA15D_SERCOM4_PAD3 MCHP_PINMUX(a, 15, d, periph)

/* pa15e_tc3_wo1 */
#define PA15E_TC3_WO1 MCHP_PINMUX(a, 15, e, periph)

/* pa15f_tcc2_wo1 */
#define PA15F_TCC2_WO1 MCHP_PINMUX(a, 15, f, periph)

/* pa15g_tcc1_wo3 */
#define PA15G_TCC1_WO3 MCHP_PINMUX(a, 15, g, periph)

/* pa15l_gmac_grxer */
#define PA15L_GMAC_GRXER MCHP_PINMUX(a, 15, l, periph)

/* pa15m_gclk_io1 */
#define PA15M_GCLK_IO1 MCHP_PINMUX(a, 15, m, periph)

/* pa16_gpio */
#define PA16_GPIO MCHP_PINMUX(a, 16, gpio, gpio)

/* pa16a_eic_extint0 */
#define PA16A_EIC_EXTINT0 MCHP_PINMUX(a, 16, a, periph)

/* pa16b_adc0_x10 */
#define PA16B_ADC0_X10 MCHP_PINMUX(a, 16, b, periph)

/* pa16b_adc0_y10 */
#define PA16B_ADC0_Y10 MCHP_PINMUX(a, 16, b, periph)

