zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/same54/atsame54n20a-pinctrl.h
/* pb20i_sdhc1_sddat2 */
#define PB20I_SDHC1_SDDAT2 MCHP_PINMUX(b, 20, i, periph)

/* pb20m_gclk_io6 */
#define PB20M_GCLK_IO6 MCHP_PINMUX(b, 20, m, periph)

/* pb21_gpio */
#define PB21_GPIO MCHP_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 MCHP_PINMUX(b, 21, a, periph)

/* pb21c_sercom3_pad1 */
#define PB21C_SERCOM3_PAD1 MCHP_PINMUX(b, 21, c, periph)

/* pb21d_sercom7_pad0 */
#define PB21D_SERCOM7_PAD0 MCHP_PINMUX(b, 21, d, periph)

/* pb21f_tcc1_wo3 */
#define PB21F_TCC1_WO3 MCHP_PINMUX(b, 21, f, periph)

/* pb21i_sdhc1_sddat3 */
#define PB21I_SDHC1_SDDAT3 MCHP_PINMUX(b, 21, i, periph)

/* pb21m_gclk_io7 */
#define PB21M_GCLK_IO7 MCHP_PINMUX(b, 21, m, periph)

/* pb22_gpio */
#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 MCHP_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 MCHP_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 MCHP_PINMUX(b, 22, e, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 MCHP_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof_1khz */
#define PB22H_USB_SOF_1KHZ MCHP_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 MCHP_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 MCHP_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 MCHP_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 MCHP_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 MCHP_PINMUX(b, 23, e, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 MCHP_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 MCHP_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 MCHP_PINMUX(b, 23, n, periph)

/* pb24_gpio */
#define PB24_GPIO MCHP_PINMUX(b, 24, gpio, gpio)

/* pb24a_eic_extint8 */
#define PB24A_EIC_EXTINT8 MCHP_PINMUX(b, 24, a, periph)

/* pb24c_sercom0_pad0 */
#define PB24C_SERCOM0_PAD0 MCHP_PINMUX(b, 24, c, periph)

/* pb24d_sercom2_pad1 */
#define PB24D_SERCOM2_PAD1 MCHP_PINMUX(b, 24, d, periph)

/* pb24g_pdec_qdi1 */
#define PB24G_PDEC_QDI1 MCHP_PINMUX(b, 24, g, periph)

/* pb24m_ac_cmp0 */
#define PB24M_AC_CMP0 MCHP_PINMUX(b, 24, m, periph)

/* pb25_gpio */
#define PB25_GPIO MCHP_PINMUX(b, 25, gpio, gpio)

/* pb25a_eic_extint9 */
#define PB25A_EIC_EXTINT9 MCHP_PINMUX(b, 25, a, periph)

/* pb25c_sercom0_pad1 */
#define PB25C_SERCOM0_PAD1 MCHP_PINMUX(b, 25, c, periph)

/* pb25d_sercom2_pad0 */
#define PB25D_SERCOM2_PAD0 MCHP_PINMUX(b, 25, d, periph)

/* pb25g_pdec_qdi2 */
#define PB25G_PDEC_QDI2 MCHP_PINMUX(b, 25, g, periph)

/* pb25m_ac_cmp1 */
#define PB25M_AC_CMP1 MCHP_PINMUX(b, 25, m, periph)

/* pb30_gpio */
#define PB30_GPIO MCHP_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 MCHP_PINMUX(b, 30, a, periph)

/* pb30c_sercom7_pad0 */
#define PB30C_SERCOM7_PAD0 MCHP_PINMUX(b, 30, c, periph)

/* pb30d_sercom5_pad1 */
#define PB30D_SERCOM5_PAD1 MCHP_PINMUX(b, 30, d, periph)

/* pb30e_tc0_wo0 */
#define PB30E_TC0_WO0 MCHP_PINMUX(b, 30, e, periph)

/* pb30f_tcc4_wo0 */
#define PB30F_TCC4_WO0 MCHP_PINMUX(b, 30, f, periph)

/* pb30g_tcc0_wo6 */
#define PB30G_TCC0_WO6 MCHP_PINMUX(b, 30, g, periph)

/* pb31_gpio */
#define PB31_GPIO MCHP_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 MCHP_PINMUX(b, 31, a, periph)

/* pb31c_sercom7_pad1 */
#define PB31C_SERCOM7_PAD1 MCHP_PINMUX(b, 31, c, periph)

/* pb31d_sercom5_pad0 */
#define PB31D_SERCOM5_PAD0 MCHP_PINMUX(b, 31, d, periph)

/* pb31e_tc0_wo1 */
#define PB31E_TC0_WO1 MCHP_PINMUX(b, 31, e, periph)

/* pb31f_tcc4_wo1 */
#define PB31F_TCC4_WO1 MCHP_PINMUX(b, 31, f, periph)

/* pb31g_tcc0_wo7 */
#define PB31G_TCC0_WO7 MCHP_PINMUX(b, 31, g, periph)

/* pc0_gpio */
#define PC0_GPIO MCHP_PINMUX(c, 0, gpio, gpio)

/* pc0a_eic_extint0 */
#define PC0A_EIC_EXTINT0 MCHP_PINMUX(c, 0, a, periph)

/* pc0b_adc1_ain10 */
#define PC0B_ADC1_AIN10 MCHP_PINMUX(c, 0, b, periph)

/* pc1_gpio */
#define PC1_GPIO MCHP_PINMUX(c, 1, gpio, gpio)

/* pc1a_eic_extint1 */
#define PC1A_EIC_EXTINT1 MCHP_PINMUX(c, 1, a, periph)

/* pc1b_adc1_ain11 */
#define PC1B_ADC1_AIN11 MCHP_PINMUX(c, 1, b, periph)

/* pc2_gpio */
#define PC2_GPIO MCHP_PINMUX(c, 2, gpio, gpio)

/* pc2a_eic_extint2 */
#define PC2A_EIC_EXTINT2 MCHP_PINMUX(c, 2, a, periph)

/* pc2b_adc1_ain4 */
#define PC2B_ADC1_AIN4 MCHP_PINMUX(c, 2, b, periph)

/* pc3_gpio */
#define PC3_GPIO MCHP_PINMUX(c, 3, gpio, gpio)

/* pc3a_eic_extint3 */
#define PC3A_EIC_EXTINT3 MCHP_PINMUX(c, 3, a, periph)

/* pc3b_adc1_ain5 */
#define PC3B_ADC1_AIN5 MCHP_PINMUX(c, 3, b, periph)

/* pc5_gpio */
#define PC5_GPIO MCHP_PINMUX(c, 5, gpio, gpio)

/* pc5a_eic_extint5 */
#define PC5A_EIC_EXTINT5 MCHP_PINMUX(c, 5, a, periph)

/* pc5c_sercom6_pad1 */
#define PC5C_SERCOM6_PAD1 MCHP_PINMUX(c, 5, c, periph)

/* pc6_gpio */
#define PC6_GPIO MCHP_PINMUX(c, 6, gpio, gpio)

/* pc6a_eic_extint6 */
#define PC6A_EIC_EXTINT6 MCHP_PINMUX(c, 6, a, periph)

/* pc6c_sercom6_pad2 */
#define PC6C_SERCOM6_PAD2 MCHP_PINMUX(c, 6, c, periph)

/* pc6i_sdhc0_sdcd */
#define PC6I_SDHC0_SDCD MCHP_PINMUX(c, 6, i, periph)

/* pc7_gpio */
#define PC7_GPIO MCHP_PINMUX(c, 7, gpio, gpio)

/* pc7a_eic_extint9 */
#define PC7A_EIC_EXTINT9 MCHP_PINMUX(c, 7, a, periph)

/* pc7c_sercom6_pad3 */
#define PC7C_SERCOM6_PAD3 MCHP_PINMUX(c, 7, c, periph)

/* pc7i_sdhc0_sdwp */
#define PC7I_SDHC0_SDWP MCHP_PINMUX(c, 7, i, periph)

/* pc10_gpio */
#define PC10_GPIO MCHP_PINMUX(c, 10, gpio, gpio)

/* pc10a_eic_extint10 */
#define PC10A_EIC_EXTINT10 MCHP_PINMUX(c, 10, a, periph)

/* pc10c_sercom6_pad2 */
#define PC10C_SERCOM6_PAD2 MCHP_PINMUX(c, 10, c, periph)

/* pc10d_sercom7_pad2 */
#define PC10D_SERCOM7_PAD2 MCHP_PINMUX(c, 10, d, periph)

/* pc10f_tcc0_wo0 */
#define PC10F_TCC0_WO0 MCHP_PINMUX(c, 10, f, periph)

/* pc10g_tcc1_wo4 */
#define PC10G_TCC1_WO4 MCHP_PINMUX(c, 10, g, periph)

